CSI API ETABS v1
cConstraint Interface
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
public interface cConstraint
Public Interface cConstraint
Dim instance As cConstraint
public interface class cConstraint
type cConstraint =  interface end
The cConstraint type exposes the following members.
Methods
Name | Description
Delete
GetDiaphragm
GetNameList
SetDiaphragm
 DEPRECATED. Defines a Diaphragm constraint.
Top
See Also
Reference
ETABSv1 Namespace